XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A31T21x_Series.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.4" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>ABOV</vendor>
  <name>A31T21x_Series</name>
  <description>ABOV Semiconductor A31T21x Device Support, Drivers and Examples</description>
  <url>https://www.abov.co.kr/data/mds/PACK/</url>
  <supportContact>abov_fae@abov.co.kr</supportContact>
  <releases>
    <release version="1.0.0" date="2022-06-09">
            - First Release for A31T214, A31T216
    </release>
  </releases>
  <keywords>
    <!-- keywords for indexing -->
    <keyword>ABOV</keyword>
    <keyword>A31T21x</keyword>
    <keyword>A31T214</keyword>
    <keyword>A31T216</keyword>
    <keyword>Touch Sensing Microcontroller</keyword>
    <keyword>32bit</keyword>
  </keywords>
  <devices>
    <family Dfamily="A31T21x Series" Dvendor="ABOV Semiconductor:126">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian" />
      <description>The ABOV A31T21x Series device family contains an ARM Cortex-M0+ processor with a versatile set of on-chip peripherals</description>
      <!-- Subfamily : A31T21x *********************************************************-->
      <subFamily DsubFamily="A31T21x">
        <processor Dclock="48000000" />
        <compile header="A31T21x/core/device/a31t21x/include/a31t21x.h" />
        <debug svd="A31T21x/toolchain/keil/svd/a31t21x.svd" />
          <feature type="VCC" n="1.8" m="5.5" />
	      <feature type="NVIC"            n="32"                    name="NVIC with 32 Interrupt Sources" />
	      <feature type="DMA"             n="4"                     name="DMA" />
	      <feature type="Memory"          n="256"                   name="Internal Code Flash Memory (CFMC)" />
	      <feature type="XTAL"            n="4000000" m="16000000"  name="External Crystal Oscillator (XTAL) "/>
	      <feature type="IntRC"           n="32000000"              name="Internal RC Oscillator with +/- 1% accuracy"/>
          <feature type="PLL"             n="1"                     name="Internal PLL up to 48MHz"/>
          <feature type="PowerMode"       n="3"                     name="Run, Sleep (Idle), Deep-Sleep (Power-down)"/>
          <feature type="PowerOther"      n="1"                     name="POR"/>
          <feature type="IOs"             n="59"                    name="GPIOs of 64-LQFP Package"/>
          <feature type="IOs"             n="44"                    name="GPIOs of 48-LQFP Package"/>
          <feature type="IOs"             n="40"                    name="GPIOs of 44-LQFP Package"/>
          <feature type="IOs"             n="28"                    name="GPIOs of 32-LQFP Package"/>
	      <feature type="UART"            n="2"                     name="UART Interface" />
	      <feature type="USART"           n="2"       				name="USART Interface" />
	      <feature type="SPI"             n="2"                     name="SPI Interface" />
	      <feature type="I2C"             n="2"                     name="I2C Interface" />
	      <feature type="ADC"             n="150"     m="12"        name="150 ksps High Performance 12-bit ADC" />
	      <feature type="Timer"           n="4"       m="16"        name="16-bit TIMER (TIMER1n)" />
	      <feature type="Timer"           n="2"       m="32"        name="32-bit TIMER (TIMER2n)" />
	      <feature type="PWM"             n="1"       m="16"        name="3-phase complementary PWM (TIMER3n)" />
	      <feature type="WDT"             n="1"                     name="Watch-dog Timer" />
	      <feature type="LCD"             n="1"       m="8.32"      name="LCD Driver (8-COM x 32-SEG)" />
	      <feature type="Touch"           n="1"       m="24"		name="Touch Key (24-ch)" />
		  <feature type="QFP"             n="64"                    name="64-LQFP Package (10x10x1.6mm)"/>
		  <feature type="QFP"             n="48"                    name="48-LQFP Package (7x7x1.6mm)"/>
		  <feature type="QFP"             n="44"                    name="44-LQFP Package (10x10x1.6mm)"/>
		  <feature type="QFP"             n="32"                    name="32-LQFP Package (7x7x1.6mm)"/>


        <memory id="IRAM1" start="0x20000000" size="0x4000" init="0" default="1" />
        <!-- Device : A31T214-->
        <device Dname="A31T214">
          <description>128KB Flash Memory</description>
          <algorithm name="A31T21x\toolchain\keil\flashloader\a31t21x_flash.flm" start="0x00000000" size="0x20000" default="1" />
          <memory id="IROM1" start="0x00000000" size="0x20000" startup="1" default="1" />
        </device>
        <!-- Device : A31T216-->
        <device Dname="A31T216">
          <description>256KB Flash Memory</description>
          <algorithm name="A31T21x\toolchain\keil\flashloader\a31t21x_flash.flm" start="0x00000000" size="0x40000" default="1" />
          <memory id="IROM1" start="0x00000000" size="0x40000" startup="1" default="1" />
        </device>
      </subFamily>
    </family>
  </devices>
  <conditions>


    <!-- condition : A31T214/A31T216 ********************************************************-->
    <condition id="A31T21x CMSIS">
      <description>filter for A31T214/A31T216 device and athe ARM compiler</description>
      <require Tcompiler="ARMCC" />
      <require Cclass="CMSIS" Cgroup="CORE" />
      <accept Dvendor="ABOV Semiconductor:126" Dname="A31T214" />
      <accept Dvendor="ABOV Semiconductor:126" Dname="A31T216" />
    </condition>
  </conditions>

  <components>
    <!-- component : A31T214/A31T216 ********************************************************-->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="A31T21x CMSIS">
      <description>System Startup for ABOV A31T21x devices</description>
      <files>
        <file category="include" name="A31T21x/core/device/a31t21x/include/" />
        <file category="header" version="1.0.0" name="A31T21x/core/device/a31t21x/include/a31t21x.h" attr="config" />
        <file category="header" version="1.0.0" name="A31T21x/core/device/a31t21x/include/a31t21x_system.h" attr="config" />

        <file category="include" name="A31T21x/core/device/a31t21x/source/" />
        <file category="source" version="1.0.0" name="A31T21x/core/device/a31t21x/source/a31t21x_system.c" attr="config" />

        <file category="include" name="A31T21x/core/device/a31t21x/source/" />
        <file category="source" version="1.0.0" name="A31T21x/core/device/a31t21x/source/a31t21x_startup_arm.s" attr="config" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="Drivers" Csub="Common" Cversion="1.0.0" condition="A31T21x CMSIS">
      <description>Common HAL Driver</description>
      <files>
        <file category="header" name="A31T21x/driver/a31t21x/include/a31t21x_driver_common.h" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="Drivers" Csub="Debug_frameWork" Cversion="1.0.0" condition="A31T21x CMSIS">
      <description>Debug Framework</description>
      <files>
        <file category="header" name="A31T21x/library/debug/include/debug_cmd.h" />
        <file category="header" name="A31T21x/library/debug/include/debug_log.h" />
        <file category="header" name="A31T21x/library/debug/include/debug_serial.h" />
        <file category="source" name="A31T21x/library/debug/source/debug_cmd.c" />
        <file category="source" name="A31T21x/library/debug/source/debug_hardfault.c" />
        <file category="source" name="A31T21x/library/debug/source/debug_log.c" />
        <file category="source" name="A31T21x/library/debug/source/debug_retarget.c" />
        <file category="source" name="A31T21x/library/debug/source/debug_serial.c" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="Drivers" Csub="adc" Cversion="1.0.0" condition="A31T21x CMSIS">
      <description>HAL driver for Analog to Digital Converter (ADC)</description>
      <files>
        <file category="header" name="A31T21x/driver/a31t21x/include/a31t21x_adc.h" />
        <file category="source" name="A31T21x/driver/a31t21x/source/a31t21x_adc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="crc" Cversion="1.0.0" condition="A31T21x CMSIS">
      <description>HAL driver for CRC</description>
      <files>
        <file category="header" name="A31T21x/driver/a31t21x/include/a31t21x_crc.h" />
        <file category="source" name="A31T21x/driver/a31t21x/source/a31t21x_crc.c" />
      </files>
    </component>
