XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A31T21x_Series.pdsc
    <component Cclass="Device" Cgroup="Drivers" Csub="dma" Cversion="1.0.0" condition="A31T21x CMSIS">
      <description>HAL driver for Direct Memory Access Controller (DMA) </description>
      <files>
        <file category="header" name="A31T21x/driver/a31t21x/include/a31t21x_dma.h" />
        <file category="source" name="A31T21x/driver/a31t21x/source/a31t21x_dma.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="fmc" Cversion="1.0.0" condition="A31T21x CMSIS">
      <description>HAL driver for Code Flash Memory Controller (FMC)</description>
      <files>
        <file category="header" name="A31T21x/driver/a31t21x/include/a31t21x_fmc.h" />
        <file category="source" name="A31T21x/driver/a31t21x/source/a31t21x_fmc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="gpio" Cversion="1.0.0" condition="A31T21x CMSIS">
      <description>HAL Driver for GPIO and Port Control Unit (GPIO) </description>
      <files>
        <file category="header" name="A31T21x/driver/a31t21x/include/a31t21x_gpio.h" />
        <file category="source" name="A31T21x/driver/a31t21x/source/a31t21x_gpio.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="i2c" Cversion="1.0.0" condition="A31T21x CMSIS">
      <description>HAL dirver for I2C interface</description>
      <files>
        <file category="header" name="A31T21x/driver/a31t21x/include/a31t21x_i2c.h" />
        <file category="source" name="A31T21x/driver/a31t21x/source/a31t21x_i2c.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="lcd" Cversion="1.0.0" condition="A31T21x CMSIS">
      <description>HAL dirver for LCD Driver</description>
      <files>
        <file category="header" name="A31T21x/driver/a31t21x/include/a31t21x_lcd.h" />
        <file category="source" name="A31T21x/driver/a31t21x/source/a31t21x_lcd.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="led" Cversion="1.0.0" condition="A31T21x CMSIS">
      <description>HAL dirver for LED Driver</description>
      <files>
        <file category="header" name="A31T21x/driver/a31t21x/include/a31t21x_led.h" />
        <file category="source" name="A31T21x/driver/a31t21x/source/a31t21x_led.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="pwr" Cversion="1.0.0" condition="A31T21x CMSIS">
      <description>HAL Driver for POWER Control (PWR)</description>
      <files>
        <file category="header" name="A31T21x/driver/a31t21x/include/a31t21x_pwr.h" />
        <file category="source" name="A31T21x/driver/a31t21x/source/a31t21x_pwr.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="scu" Cversion="1.0.0" condition="A31T21x CMSIS">
      <description>HAL Driver for System Control Unit (SCU)</description>
      <files>
        <file category="header" name="A31T21x/driver/a31t21x/include/a31t21x_scu.h" />
        <file category="source" name="A31T21x/driver/a31t21x/source/a31t21x_scu.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="spi" Cversion="1.0.0" condition="A31T21x CMSIS">
      <description>HAL Driver for SPI interface</description>
      <files>
        <file category="header" name="A31T21x/driver/a31t21x/include/a31t21x_spi.h" />
        <file category="source" name="A31T21x/driver/a31t21x/source/a31t21x_spi.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="timer" Cversion="1.0.0" condition="A31T21x CMSIS">
      <description>HAL Driver for 16-bit Timer (TIMER1n)</description>
      <files>
        <file category="header" name="A31T21x/driver/a31t21x/include/a31t21x_timer.h" />
        <file category="source" name="A31T21x/driver/a31t21x/source/a31t21x_timer.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="timer30" Cversion="1.0.0" condition="A31T21x CMSIS">
      <description>HAL Driver for 3-phase complementary PWM (TIMER30)</description>
      <files>
        <file category="header" name="A31T21x/driver/a31t21x/include/a31t21x_timer30.h" />
        <file category="source" name="A31T21x/driver/a31t21x/source/a31t21x_timer30.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="uart" Cversion="1.0.0" condition="A31T21x CMSIS">
      <description>HAL Driver for UART Interface</description>
      <files>
        <file category="header" name="A31T21x/driver/a31t21x/include/a31t21x_uart.h" />
        <file category="source" name="A31T21x/driver/a31t21x/source/a31t21x_uart.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="usart1n" Cversion="1.0.0" condition="A31T21x CMSIS">
      <description>HAL Driver for USART Interface</description>
      <files>
        <file category="header" name="A31T21x/driver/a31t21x/include/a31t21x_usart1n.h" />
        <file category="source" name="A31T21x/driver/a31t21x/source/a31t21x_usart1n.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="wdt" Cversion="1.0.0" condition="A31T21x CMSIS">
      <description>HAL Driver for Watch-dog Timer (WDT)</description>
      <files>
        <file category="header" name="A31T21x/driver/a31t21x/include/a31t21x_wdt.h" />
        <file category="source" name="A31T21x/driver/a31t21x/source/a31t21x_wdt.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="wt" Cversion="1.0.0" condition="A31T21x CMSIS">
      <description>HAL Driver for Watch Timer (WT)</description>
      <files>
        <file category="header" name="A31T21x/driver/a31t21x/include/a31t21x_wt.h" />
        <file category="source" name="A31T21x/driver/a31t21x/source/a31t21x_wt.c" />
      </files>
    </component>
  </components>

  <boards>
    <!-- board : STK-A31T216-RLN-A V1.0 ************************************************************-->
    <board vendor="ABOV" name="STK-A31T216-RLN-A" revision="V1.0">
      <description>STK-A31T216-RLN-A V1.0</description>
      <mountedDevice deviceIndex="0" Dvendor="ABOV Semiconductor:126" Dname="A31T216" />
      <compatibleDevice deviceIndex="0" Dvendor="ABOV Semiconductor:126" Dname="A31T214" />
      <feature type="ODbg"   n="1"              name="On-board Type A-Link Debugger"/>
      <feature type="ROM"                       name="256KB Internal Code Flash Memory" />
      <feature type="RAM"                       name="16KB SRAM" />
      <feature type="XTAL"   n="8000000"        name="8MHz Crystal Oscillator" />
      <feature type="Other"                     name="32.768kHz RTC Sub Crystal Oscillator" />
      <feature type="PWR"    n="3.3"   m="5.0"  name="USB Powered" />
      <feature type="PWR"    n="1.8"   m="5.0"  name="External Power Supply" />
      <feature type="Button" n="2"              name="Tact-buttons : USER and nRESET" />
      <feature type="LED"    n="6"              name="6 LEDs: D101~106" />
	  <debugInterface adapter="CMSIS-DAP" connector="Micro-USB"/>
    </board>
  </boards>


  <!-- example : A31T214/A31T216 **********************************************************-->
  <examples>

