XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A31T21x_Series.pdsc
    <!-- peripheral examples *********************************************************************-->
    <example name="adc_interrupt" doc="Abstract.txt" folder="A31T21x/example/peripheral/adc_interrupt">
      <description>adc_interrupt</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="adc_polling" doc="Abstract.txt" folder="A31T21x/example/peripheral/adc_polling">
      <description>adc_polling</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="clock_external_main_oscillator" doc="Abstract.txt" folder="A31T21x/example/peripheral/clock_external_main_oscillator">
      <description>clock_external_main_oscillator</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="clock_external_sub_oscillator" doc="Abstract.txt" folder="A31T21x/example/peripheral/clock_external_sub_oscillator">
      <description>clock_external_sub_oscillator</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="clock_internal_high_speed_oscillator" doc="Abstract.txt" folder="A31T21x/example/peripheral/clock_internal_high_speed_oscillator">
      <description>clock_internal_high_speed_oscillator</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="clock_internal_low_speed_oscillator" doc="Abstract.txt" folder="A31T21x/example/peripheral/clock_internal_low_speed_oscillator">
      <description>clock_internal_low_speed_oscillator</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="clock_monitoring" doc="Abstract.txt" folder="A31T21x/example/peripheral/clock_monitoring">
      <description>clock_monitoring</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="clock_pin_output" doc="Abstract.txt" folder="A31T21x/example/peripheral/clock_pin_output">
      <description>clock_pin_output</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="clock_pll_oscillator" doc="Abstract.txt" folder="A31T21x/example/peripheral/clock_pll_oscillator">
      <description>clock_pll_oscillator</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="crc_16_Interrupt" doc="Abstract.txt" folder="A31T21x/example/peripheral/crc_16_Interrupt">
      <description>crc_16_Interrupt</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="crc_16_polling" doc="Abstract.txt" folder="A31T21x/example/peripheral/crc_16_polling">
      <description>crc_16_polling</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="crc_ccitt_Interrupt" doc="Abstract.txt" folder="A31T21x/example/peripheral/crc_ccitt_Interrupt">
      <description>crc_ccitt_Interrupt</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="crc_ccitt_polling" doc="Abstract.txt" folder="A31T21x/example/peripheral/crc_ccitt_polling">
      <description>crc_ccitt_polling</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="flash_protect" doc="Abstract.txt" folder="A31T21x/example/peripheral/flash_protect">
      <description>flash_protect</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="flash_self_write_erase" doc="Abstract.txt" folder="A31T21x/example/peripheral/flash_self_write_erase">
      <description>flash_self_write_erase</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="flash_write_erase" doc="Abstract.txt" folder="A31T21x/example/peripheral/flash_write_erase">
      <description>flash_write_erase</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="gpio_exint" doc="Abstract.txt" folder="A31T21x/example/peripheral/gpio_exint">
      <description>gpio_exint</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="gpio_input" doc="Abstract.txt" folder="A31T21x/example/peripheral/gpio_input">
      <description>gpio_input</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="gpio_ledblinky" doc="Abstract.txt" folder="A31T21x/example/peripheral/gpio_ledblinky">
      <description>gpio_ledblinky</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="i2c_master_interrupt" doc="Abstract.txt" folder="A31T21x/example/peripheral/i2c_master_interrupt">
      <description>i2c_master_interrupt</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="i2c_master_polling" doc="Abstract.txt" folder="A31T21x/example/peripheral/i2c_master_polling">
      <description>i2c_master_polling</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="i2c_slave_interrupt" doc="Abstract.txt" folder="A31T21x/example/peripheral/i2c_slave_interrupt">
      <description>i2c_slave_interrupt</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="i2c_slave_polling" doc="Abstract.txt" folder="A31T21x/example/peripheral/i2c_slave_polling">
      <description>i2c_slave_polling</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="lcd" doc="Abstract.txt" folder="A31T21x/example/peripheral/lcd">
      <description>lcd</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="led" doc="Abstract.txt" folder="A31T21x/example/peripheral/led">
      <description>led</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="pwr_deep_sleep_mode" doc="Abstract.txt" folder="A31T21x/example/peripheral/pwr_deep_sleep_mode">
      <description>pwr_deep_sleep_mode</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="pwr_lvi_interrupt" doc="Abstract.txt" folder="A31T21x/example/peripheral/pwr_lvi_interrupt">
      <description>pwr_lvi_interrupt</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="pwr_lvr_polling" doc="Abstract.txt" folder="A31T21x/example/peripheral/pwr_lvr_polling">
      <description>pwr_lvr_polling</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="pwr_sleep_mode" doc="Abstract.txt" folder="A31T21x/example/peripheral/pwr_sleep_mode">
      <description>pwr_sleep_mode</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="spi_dma_interrupt" doc="Abstract.txt" folder="A31T21x/example/peripheral/spi_dma_interrupt">
      <description>spi_dma_interrupt</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="spi_interrupt" doc="Abstract.txt" folder="A31T21x/example/peripheral/spi_interrupt">
      <description>spi_interrupt</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="spi_polling" doc="Abstract.txt" folder="A31T21x/example/peripheral/spi_polling">
      <description>spi_polling</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="sram" doc="Abstract.txt" folder="A31T21x/example/peripheral/sram">
      <description>sram</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="timer1n_capture" doc="Abstract.txt" folder="A31T21x/example/peripheral/timer1n_capture">
      <description>timer1n_capture</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="timer1n_oneshot" doc="Abstract.txt" folder="A31T21x/example/peripheral/timer1n_oneshot">
      <description>timer1n_oneshot</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="timer1n_periodic" doc="Abstract.txt" folder="A31T21x/example/peripheral/timer1n_periodic">
      <description>timer1n_periodic</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="timer1n_pwm" doc="Abstract.txt" folder="A31T21x/example/peripheral/timer1n_pwm">
      <description>timer1n_pwm</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="timer2n_capture" doc="Abstract.txt" folder="A31T21x/example/peripheral/timer2n_capture">
      <description>timer2n_capture</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="timer2n_oneshot" doc="Abstract.txt" folder="A31T21x/example/peripheral/timer2n_oneshot">
      <description>timer2n_oneshot</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="timer2n_periodic" doc="Abstract.txt" folder="A31T21x/example/peripheral/timer2n_periodic">
      <description>timer2n_periodic</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="timer2n_pwm" doc="Abstract.txt" folder="A31T21x/example/peripheral/timer2n_pwm">
      <description>timer2n_pwm</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="timer30_backtoback" doc="Abstract.txt" folder="A31T21x/example/peripheral/timer30_backtoback">
      <description>timer30_backtoback</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="timer30_capture" doc="Abstract.txt" folder="A31T21x/example/peripheral/timer30_capture">
      <description>timer30_capture</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="timer30_interval" doc="Abstract.txt" folder="A31T21x/example/peripheral/timer30_interval">
      <description>timer30_interval</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="uart_interrupt" doc="Abstract.txt" folder="A31T21x/example/peripheral/uart_interrupt">
      <description>uart_interrupt</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="uart_polling" doc="Abstract.txt" folder="A31T21x/example/peripheral/uart_polling">
      <description>uart_polling</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
