XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A31T21x_Series.pdsc
    <example name="usart_spi_interrupt" doc="Abstract.txt" folder="A31T21x/example/peripheral/usart_spi_interrupt">
      <description>usart_spi_interrupt</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="usart_spi_polling" doc="Abstract.txt" folder="A31T21x/example/peripheral/usart_spi_polling">
      <description>usart_spi_polling</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="usart_uart_interrupt" doc="Abstract.txt" folder="A31T21x/example/peripheral/usart_uart_interrupt">
      <description>usart_uart_interrupt</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="usart_uart_polling" doc="Abstract.txt" folder="A31T21x/example/peripheral/usart_uart_polling">
      <description>usart_uart_polling</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="usart_usart_interrupt" doc="Abstract.txt" folder="A31T21x/example/peripheral/usart_usart_interrupt">
      <description>usart_usart_interrupt</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="usart_usart_polling" doc="Abstract.txt" folder="A31T21x/example/peripheral/usart_usart_polling">
      <description>usart_usart_polling</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="wdt_interrupt" doc="Abstract.txt" folder="A31T21x/example/peripheral/wdt_interrupt">
      <description>wdt_interrupt</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="wdt_reset" doc="Abstract.txt" folder="A31T21x/example/peripheral/wdt_reset">
      <description>wdt_reset</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="wt_interrupt" doc="Abstract.txt" folder="A31T21x/example/peripheral/wt_interrupt">
      <description>wt_interrupt</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="wt_polling" doc="Abstract.txt" folder="A31T21x/example/peripheral/wt_polling">
      <description>wt_polling</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>

    <!-- cortexm examples *********************************************************************-->
    <example name="systick" doc="Abstract.txt" folder="A31T21x/example/cortexm/systick">
      <description>systick</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>

    <!-- starterkit examples *********************************************************************-->
    <example name="gpio_ledblinky" doc="Abstract.txt" folder="A31T21x/example/starterkit/gpio_ledblinky">
      <description>gpio_ledblinky</description>
      <board name="STK-A31T216-RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="a31t21x/keil/app.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>

  </examples>
</package>